<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"1391ed1e73bbd07f116e3255be228f602541d5bc9536d6be60957d7accb3fc79","plan_job_ref":"Job Staging Image Build & Push #52 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337590022","plan_hash":"7bf08a346d595f285104a830904f29045330de1e972ac2bd2d60722b229c0c6f","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 2 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be updated in-place
!~  resource "aws_ecs_service" "fastapi-service" {
        id                                 = "arn:aws:ecs:eu-central-1:806066816337:service/fastapi-cluster/dev-fastapi-service"
        name                               = "dev-fastapi-service"
        tags                               = {}
!~      tags_all                           = {
+           "Environment" = "Dev Environment"
        }
#        (16 unchanged attributes hidden)

+       load_balancer {
+           container_name   = "mongo"
+           container_port   = 8080
+           target_group_arn = (known after apply)
        }

#        (3 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be created
+   resource "aws_lb_listener" "front_end" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:loadbalancer/app/fastapi-lb-dev/a62c3bfa18223c2b"
+       port              = 5000
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = {
+           "Environment" = "Dev Environment"
        }

+       default_action {
+           order            = (known after apply)
+           target_group_arn = (known after apply)
+           type             = "forward"
        }
    }

  # aws_lb_target_group.alb-tg will be created
+   resource "aws_lb_target_group" "alb-tg" {
+       arn                                = (known after apply)
+       arn_suffix                         = (known after apply)
+       connection_termination             = (known after apply)
+       deregistration_delay               = "300"
+       id                                 = (known after apply)
+       ip_address_type                    = (known after apply)
+       lambda_multi_value_headers_enabled = false
+       load_balancing_algorithm_type      = (known after apply)
+       load_balancing_cross_zone_enabled  = (known after apply)
+       name                               = "fastapi-alb-target-group-for-dev"
+       name_prefix                        = (known after apply)
+       port                               = 5000
+       preserve_client_ip                 = (known after apply)
+       protocol                           = "HTTP"
+       protocol_version                   = (known after apply)
+       proxy_protocol_v2                  = false
+       slow_start                         = 0
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       target_type                        = "alb"
+       vpc_id                             = "*********************"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #52](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7337590022)